---
title: RebarSpliceRules
classe: Autodesk.Revit.DB.Structure.RebarSpliceRules
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# RebarSpliceRules

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `rebarSpliceRules.IsValidObject` | Boolean |
| `Double MaximumBarLength { get; set; }` | `rebarSpliceRules.MaximumBarLength` | Double |
| `Double MinimumBarLength { get; set; }` | `rebarSpliceRules.MinimumBarLength` | Double |
| `RebarSpliceByRulesRunOutPosition RunOutPosition { get; set; }` | `rebarSpliceRules.RunOutPosition` | RebarSpliceByRulesRunOutPosition |
| `RebarSpliceRules Create(Document)` | `RebarSpliceRules.Create(document)` | RebarSpliceRules |
| `Void Dispose()` | `rebarSpliceRules.Dispose()` | Void |
| `Void SetMaximumAndMinimumBarLength(Double, Double)` | `rebarSpliceRules.SetMaximumAndMinimumBarLength(maximumBarLength, minimumBarLength)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```